<?php
return [
    'user' => [
        'status' => [
            'only_concern' => 0,   //仅公众号关注
            'normal' => 1,         //正常注册用户
            'worker' => 2,         //正常注册用户，也是企业员工
            'disable' => 3,        //禁用
            'join_enterprise' => 4,//正常注册用户，正在申请加入企业
            'worker_reject' => 5,  //正常注册用户，申请加入企业被驳回
        ]
    ],
    'paginate' => 10,               //分页数
    'enterprise' => [               //企业
        'status' => [               //状态
            'wait_examine' => 0,    //等待审批
            'normal' => 1,          //正常
            'reject' => 2,          //驳回
        ],
         'type' => [
            '1' => '农、林、牧、渔业',
            '2' => '采矿业',
            '3' => '制造业',
            '4' => '电力、热力、燃气及水的生成和供应业',
            '5' => '环境和公共设施管理业',
            '6' => '建筑业',
            '7' => '交通运输、仓储业和邮政业',
            '8' => '信息传输、计算机服务和软件业',
            '9' => '批发和零售',
            '10' => '住宿和餐饮业',
            '11' => '金融业',
            '12' => '房地产业',
            '13' => '租赁和商务服务',
            '14' => '科学研究、技术服务和地址勘察',
            '15' => '水利、环境和公共设施管理',
            '16' => '居民服务和其他服务',
            '17' => '教育',
            '18' => '卫生、社会保障和社会福利',
            '19' => '文化、体育和娱乐业',
            '20' => '公共管理和社会组织',
            '21' => '国际组织'
        ],
    ],

    'enterprise_admin' => [         //企业管理员
        'main' => 1,                //主管理员
        'not_main' => 0,            //普通管理员
    ],
    'operate_type' => [             //操作类型
        'reject' => [               //驳回
            'enterprise' => '驳回企业申请',
            'worker' => '驳回员工申请'
        ],
    ]
];
